# ElementsContainsFabricationData Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..ElementsContainsFabricationData Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to load models containing elements with fabrication data as group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsContainsFabricationData { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsContainsFabricationData As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsContainsFabricationData {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace